#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ИдентификаторПодключенияУникален(Объект, Отказ) Экспорт
	
	ТекстСообщения = ""; 
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторПодключения) Тогда
		// Уникальность проверяем только для заполненных
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключенияКвнешнимСистемам.Представление КАК Представление,
		|	ПодключенияКвнешнимСистемам.Код КАК Код
		|ИЗ
		|	Справочник.QIWI_АдаптерПодключенияКВнешнимСистемам КАК ПодключенияКвнешнимСистемам
		|ГДЕ
		|	ПодключенияКвнешнимСистемам.ИдентификаторПодключения = &ИдентификаторПодключения
		|	И ПодключенияКвнешнимСистемам.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("ИдентификаторПодключения", Объект.ИдентификаторПодключения);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ТекстСообщения = СтрШаблон("Процесс с таким идентификатором уже существует %1 %2",
			Выборка.Код, Выборка.Представление);
			Отказ = Истина;
			Возврат ТекстСообщения;		
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецЕсли