
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияСвязанныхПолей(); 
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СообщениеПриИзменении(Элемент)
	УстановитьЗначенияСвязанныхПолей();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Процедура УстановитьЗначенияСвязанныхПолей()
	
	ИменаРеквизитов = "ТипСообщения";
	СтруктураРеквизитов = QIWI_АдаптерШлюзБСПСервер.ЗначенияРеквизитовОбъекта(Запись.Сообщение, ИменаРеквизитов);
	ТипСообщения = СтруктураРеквизитов.ТипСообщения;
		
КонецПроцедуры
   
#КонецОбласти
