#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ИдентификаторПроцессаУникален(Объект, Отказ) Экспорт
	
	ТекстСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнтеграционныеПроцессы.Представление КАК Представление,
	|	ИнтеграционныеПроцессы.Код КАК Код
	|ИЗ
	|	Справочник.QIWI_АдаптерИнтеграционныеПроцессы КАК ИнтеграционныеПроцессы
	|ГДЕ
	|	ИнтеграционныеПроцессы.ИдентификаторПроцесса = &ИдентификаторПроцесса
	|	И ИнтеграционныеПроцессы.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ИдентификаторПроцесса", Объект.ИдентификаторПроцесса);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстСообщения = СтрШаблон("Процесс с таким идентификатором уже существует %1 %2",
									Выборка.Код, Выборка.Представление);		
		Возврат ТекстСообщения;		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции	

#КонецЕсли