#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
Функция ИдентификаторТипаИсходящегоУникален(Объект, Отказ) Экспорт
	
	ТекстСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипИсходящегоСообщения.Представление КАК Представление,
	|	ТипИсходящегоСообщения.Код КАК Код
	|ИЗ
	|	Справочник.QIWI_АдаптерТипИсходящегоСообщения КАК ТипИсходящегоСообщения
	|ГДЕ
	|	ТипИсходящегоСообщения.ТехническоеИмя = &ТехническоеИмя
	|	И ТипИсходящегоСообщения.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ТехническоеИмя", Объект.ТехническоеИмя);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстСообщения = СтрШаблон("Тип исходящего сообщения с таким техническим именем (мнемокодом) уже существует %1 %2",
									Выборка.Код, Выборка.Представление);		
		Отказ = Истина;							
		Возврат ТекстСообщения;		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецЕсли