#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ДополнительныеСвойства.Свойство("ПроверкаВыполнена") Тогда
		ТекстСообщения = Справочники.QIWI_АдаптерТипИсходящегоСообщения.ИдентификаторТипаИсходящегоУникален(ЭтотОбъект, Отказ);
		Если Отказ Тогда			
			QIWI_АдаптерШлюзБСПКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры  

#КонецЕсли